In [1]:
import pandas as pd
import numpy as np
pd.options.display.max_rows=20
pd.options.display.max_columns=5

In [2]:
data = {
    "name": ["vicky","sanket","satyam","rugved","suraj"],
    "age" : [20,21,25,24,22],
    "address": ["pune","mumbai","nashik","chennai","kolkata"]
}

In [4]:
df = pd.DataFrame(data)
df

     name  age  address
0   vicky   20     pune
1  sanket   21   mumbai
2  satyam   25   nashik
3  rugved   24  chennai
4   suraj   22  kolkata

In [5]:
df1  = df.set_index("name")
df1

        age  address
name
vicky    20     pune
sanket   21   mumbai
satyam   25   nashik
rugved   24  chennai
suraj    22  kolkata

In [14]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [18]:
df2  =pd.DataFrame(data, index=([10,20,30,40,50]), columns=["try1","try2","tr3"])

In [17]:
df.columns

Index(['name', 'age', 'address'], dtype='object')

In [23]:
data

{'name': ['vicky', 'sanket', 'satyam', 'rugved', 'suraj'],
 'age': [20, 21, 25, 24, 22],
 'address': ['pune', 'mumbai', 'nashik', 'chennai', 'kolkata']}

In [30]:
df2  =pd.DataFrame(data, index=[1,2,3,4,5],)
df2

     name  age  address
1   vicky   20     pune
2  sanket   21   mumbai
3  satyam   25   nashik
4  rugved   24  chennai
5   suraj   22  kolkata

In [31]:
df2  =pd.DataFrame(data, columns=["try1","try2","tr3"])
df2

Empty DataFrame
Columns: [try1, try2, tr3]
Index: []

In [35]:
df2  =pd.DataFrame(data, index =["A" ,"B" ,"C", "D", "E"])
df2.rename(columns=({"name": "a", "age": "b","address":"c"}))

        a   b        c
A   vicky  20     pune
B  sanket  21   mumbai
C  satyam  25   nashik
D  rugved  24  chennai
E   suraj  22  kolkata

In [36]:
df2.loc["A"]

name       vicky
age           20
address     pune
Name: A, dtype: object

In [37]:
df2.loc["A":"C"]

     name  age address
A   vicky   20    pune
B  sanket   21  mumbai
C  satyam   25  nashik

In [38]:
df2.loc[["A":"B"],["name","address"]]

SyntaxError: invalid syntax (3354605297.py, line 1)

In [39]:
df2.loc["A":"B"]

     name  age address
A   vicky   20    pune
B  sanket   21  mumbai

In [40]:
df2.loc[["A","B"],["name","address"]]

     name address
A   vicky    pune
B  sanket  mumbai

In [41]:
df2.iloc[0:2]

     name  age address
A   vicky   20    pune
B  sanket   21  mumbai

In [42]:
df2.iloc[[0,3],[0,1]]

     name  age
A   vicky   20
D  rugved   24

In [43]:
df2.iloc[[0,3],[0,2]]

     name  address
A   vicky     pune
D  rugved  chennai

In [44]:
df2

     name  age  address
A   vicky   20     pune
B  sanket   21   mumbai
C  satyam   25   nashik
D  rugved   24  chennai
E   suraj   22  kolkata

In [45]:
df2["salary"] = [1000,2000,3000,np.nan,np.nan]

In [46]:
df2

     name  age  address  salary
A   vicky   20     pune  1000.0
B  sanket   21   mumbai  2000.0
C  satyam   25   nashik  3000.0
D  rugved   24  chennai     NaN
E   suraj   22  kolkata     NaN

In [47]:
df2.dropna()

     name  age address  salary
A   vicky   20    pune  1000.0
B  sanket   21  mumbai  2000.0
C  satyam   25  nashik  3000.0

In [48]:
df2.drop(2)

KeyError: '[2] not found in axis'

In [49]:
df2.drop("age")

KeyError: "['age'] not found in axis"

In [50]:
df2.drop("age",axis=1)

     name  address  salary
A   vicky     pune  1000.0
B  sanket   mumbai  2000.0
C  satyam   nashik  3000.0
D  rugved  chennai     NaN
E   suraj  kolkata     NaN

In [52]:
df2.drop("C")  # axis=0

     name  age  address  salary
A   vicky   20     pune  1000.0
B  sanket   21   mumbai  2000.0
D  rugved   24  chennai     NaN
E   suraj   22  kolkata     NaN

In [53]:
df2.reset_index()

  index    name  age  address  salary
0     A   vicky   20     pune  1000.0
1     B  sanket   21   mumbai  2000.0
2     C  satyam   25   nashik  3000.0
3     D  rugved   24  chennai     NaN
4     E   suraj   22  kolkata     NaN

In [54]:
df2[df2["age"]<24]

     name  age  address  salary
A   vicky   20     pune  1000.0
B  sanket   21   mumbai  2000.0
E   suraj   22  kolkata     NaN

In [55]:
df2[df2["age"]<24]["name"]

A     vicky
B    sanket
E     suraj
Name: name, dtype: object

In [56]:
df2[df2["age"]<24][["name","age"]]

     name  age
A   vicky   20
B  sanket   21
E   suraj   22

In [57]:
df2["F"]=[{"name":"abhjijit","age":25,"address":"pune"}]

ValueError: Length of values (1) does not match length of index (5)

In [58]:
df2

     name  age  address  salary
A   vicky   20     pune  1000.0
B  sanket   21   mumbai  2000.0
C  satyam   25   nashik  3000.0
D  rugved   24  chennai     NaN
E   suraj   22  kolkata     NaN

In [59]:
df2["F"]=[{"name":"abhjijit","age":25,"address":"pune","salary":2800}]

ValueError: Length of values (1) does not match length of index (5)

In [74]:
new_row = {"name":"abhjijit","age":25,"address":"pune","salary":2800}
df2.loc[len(df2)] = new_row
print(df2)
# df2.index="A B C D E F".split()

       name  age  address  salary           F
A     vicky   20     pune  1000.0     Rughwed
B    sanket   21   mumbai  2000.0          25
C    satyam   25   nashik  3000.0  ahmedadbad
D    rugved   24  chennai     NaN        3005
E     suraj   22  kolkata     NaN       gughu
F  abhjijit   25     pune  2800.0          45
G  abhjijit   25     pune  2800.0         NaN
7  abhjijit   25     pune  2800.0         NaN
8  abhjijit   25     pune  2800.0         NaN

In [80]:
new_row = {"name":"abhjijit","age":25,"address":"pune","salary":2800}
df2.loc["H"] = new_row
print(df2)

       name  age  address  salary           F
A     vicky   20     pune  1000.0     Rughwed
B    sanket   21   mumbai  2000.0          25
C    satyam   25   nashik  3000.0  ahmedadbad
D    rugved   24  chennai     NaN        3005
E     suraj   22  kolkata     NaN       gughu
F  abhjijit   25     pune  2800.0          45
G  abhjijit   25     pune  2800.0         NaN
7  abhjijit   25     pune  2800.0         NaN
8  abhjijit   25     pune  2800.0         NaN
9        ss   22    dasss  1000.0          ss
H  abhjijit   25     pune  2800.0         NaN

In [82]:
df2.drop("F",axis=1)

       name  age  address  salary
A     vicky   20     pune  1000.0
B    sanket   21   mumbai  2000.0
C    satyam   25   nashik  3000.0
D    rugved   24  chennai     NaN
E     suraj   22  kolkata     NaN
F  abhjijit   25     pune  2800.0
G  abhjijit   25     pune  2800.0
7  abhjijit   25     pune  2800.0
8  abhjijit   25     pune  2800.0
9        ss   22    dasss  1000.0
H  abhjijit   25     pune  2800.0

In [85]:
df2.drop(["F","G",7,8,9],axis=0,inplace=True)

In [90]:
df2

       name  age  address  salary
A     vicky   20     pune  1000.0
B    sanket   21   mumbai  2000.0
C    satyam   25   nashik  3000.0
D    rugved   24  chennai     NaN
E     suraj   22  kolkata     NaN
H  abhjijit   25     pune  2800.0

In [114]:
df2.dropna(thresh = 4, axis=0)  # min 4 non null values should be present in rows otherwise drop it

       name  age address  salary
A     vicky   20    pune  1000.0
B    sanket   21  mumbai  2000.0
C    satyam   25  nashik  3000.0
H  abhjijit   25    pune  2800.0

In [112]:
df2.dropna(thresh=2,axis=1)

       name  age  address  salary
A     vicky   20     pune  1000.0
B    sanket   21   mumbai  2000.0
C    satyam   25   nashik  3000.0
D    rugved   24  chennai     NaN
E     suraj   22  kolkata     NaN
H  abhjijit   25     pune  2800.0

In [113]:
df2.dropna(thresh=5,axis=1)  # min 5 non null values should be present in col otherwise drop it

       name  age  address
A     vicky   20     pune
B    sanket   21   mumbai
C    satyam   25   nashik
D    rugved   24  chennai
E     suraj   22  kolkata
H  abhjijit   25     pune

In [99]:
import pandas as pd
import numpy as np

new_df = pd.DataFrame({
    'A': [1, 2, np.nan, 4],
    'B': [np.nan, 2, 3, 4],
    'C': [1, 2, 3, np.nan]
})

In [100]:
new_df

     A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  2.0
2  NaN  3.0  3.0
3  4.0  4.0  NaN

In [115]:
new_df.dropna(thresh=4,axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

: